//*************************************************************************************************
//*																								  *
//*			 ******************************LCD12864驱动程序头文件**********************			  *
//*																								  *
//*************************************************************************************************
#ifndef __LCD12864_H__
#define __LCD12864_H__

#define	CS1 P2_5
#define	CS2	P2_4

#define LCDSTARTROW 0xC0			  //设置起始行指令。
#define LCDPAGE 0xB8				  //设置页指令。
#define LCDLINE 0x40				  //设置列指令。

//*************************************************************************************************
//*																								  *
//*			 ********************************基本函数*********************************			  *
//*																								  *
//*************************************************************************************************

//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<读忙标志位>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
bit bCheckBusy();


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<写数据>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vWriteData(unsigned char ucData);


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<写指令>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vWriteCMD(unsigned char ucCMD);


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<LCD初始化函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vLCDInitialize();




//*************************************************************************************************
//*																								  *
//*			 ********************************高级函数*********************************			  *
//*																								  *
//*************************************************************************************************
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<显示自定义行>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vShowCustomRow(unsigned char ucPage,unsigned char ucLine,unsigned char ucWidth,unsigned char *ucaRow);
											//在8×128的格子里显示自定义长度的一行
											//取值范围：ucPage:0～7；ucLine:0～127；
											//ucWidth:0～127；ucLine+ucWidth<128。


									
//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<汉字显示函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vShowOneChin(unsigned char ucPage,unsigned char ucLine,unsigned char *ucaChinMap);
											 //取值范围：ucPage:0～6；ucline:0～112。


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<字符显示函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vShowOneChar(unsigned char ucPage,unsigned char ucLine,unsigned char *ucaCharMap);
											 //取值范围：ucPage:0～6；ucline:0～120。


//<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<<显示图片函数>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
void vShowGraph(unsigned char ucPage,unsigned char ucLine,unsigned char ucWidth,unsigned char ucHigh,unsigned char * ucaGraph);
											//取值范围：ucPage:0～7；ucLine:0～127；
											//ucWidth:0～127；ucHigh:0～6；
											//ucPage+ucHigh<8；ucLine+ucWidth<128。


#endif