
/*************	功能说明	**************

本文件为STC15xxx系列的端口初始化程序,用户几乎可以不修改这个程序.


******************************************/

#include	"delay.h"



//========================================================================
// 函数: void  delay_ms
// 描述: 延时函数。
// 参数: ms,要延时的ms数, 这里只支持1~65536ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2013-4-1
// 备注: 
//========================================================================
void delay_ms(u16 ms)
{
   u16 i;
	 do{
	    i = (u16)(MAIN_Fosc / 13000);
		  while(--i)	;   //14T per loop
     }while(--ms);
}

